import time
import asyncio

def sync_task(name, delay):
  #синхронная версия
  print(f"Начали {name}...")
  time.sleep(delay)
  print(f"Закончили {name}!")

print("=== Начало синхронного выполнения ===")
start_time = time.time()
  
# Запускаем 3 задачи, каждая длится 1 секунду
sync_task("Задача 1", 1)
sync_task("Задача 2", 1)
sync_task("Задача 3", 1)

end_time = time.time()
print(f"=== Все готово за {end_time - start_time:.2f} сек ===")
# Запуск программы - затраты времени 3.05 сек!

async def async_task(name, delay):
  #синхронная версия
  print(f"Начали {name}...")
  await asyncio.sleep(delay)
  print(f"Закончили {name}!")
  
  
async def main():
    start_time = asyncio.get_event_loop().time()
    
    await asyncio.gather(
      async_task("Задача 1", 1),
      async_task("Задача 2", 1),
      async_task("Задача 3", 1)  
    )
    
    end_time = asyncio.get_event_loop().time()
    print(f"=== Все готово за {end_time - start_time:.2f} сек ===")


asyncio.run(main())
#Результат: Программа выведет все три сообщения "Начали...", затем подождет 1 секунду и выведет все три "Закончили...". Общее время составит около 1.00 сек вместо 3! 🚀